# INTRO TO DATA VISUALIZATION WITH PYTHON (Task) - 1

# 1. Installing libraries

# 2. Importing 'customers' dataframe as 'cust':

# 3. Wrangling of 'cust'

## 3.1. Removing 'date_joined' column

## 3.2. Renaming 'Surnam', 'First Name', 'n_dependants'

# 4. Consitency checks of 'cust' (missing values, duplicates, mixed types)

# 5. Combining 'customer' df with 'orders_products_merged_new_columns_and_flags.pkl' on 'user_id'

# 6. Exporting 'orders_products_cust_merged' as 'orders_products_customers_merged.pkl'

In [9]:
# ----------------------------------------------------

# 1. Installing libraries

In [1]:
# Item 3. Install libraries:

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

# 2. Importing 'customers' dataframe as 'cust':

In [3]:
    # Define the path
    
path = r'/Users/elena/Documents/Data Analytics Course/4. Python fundamentals for Data Analysts/Instacart Basket Analysis'

In [4]:
    # Import customers.csv:

cust = pd.read_csv(os.path.join(path, '02 Data','Original Data','customers.csv'))

In [5]:
cust.shape

(206209, 10)

In [5]:
cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# 3. Wrangling of 'cust'

## 3.1. Removing 'date_joined' column

In [7]:
    # Remove column 'date_joined' from 'cust':

cust = cust.drop(columns = ['date_joined'])

In [8]:
cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1,married,40374

## 3.2. Renaming 'Surnam', 'First Name', 'n_dependants'

In [9]:
    # Rename 'Surnam' column into 'last_name':
    
cust.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [10]:
    # Rename 'First Name' column into 'first_name':
    
cust.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [11]:
    # Rename 'n_dependants' column into 'no_of_dependants':
    
cust.rename(columns = {'n_dependants' : 'no_of_dependants'}, inplace = True)

In [12]:
cust.head()

,user_id,first_name,last_name,Gender,STATE,Age,no_of_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1,married,40374

# 4. Consitency checks of 'cust' (missing values, duplicates, mixed types)

In [13]:
# Check for missing values in 'cust':
    
cust.isnull().sum()

user_id                 0
first_name          11259
last_name               0
Gender                  0
STATE                   0
Age                     0
no_of_dependants        0
fam_status              0
income                  0
dtype: int64

In [14]:
# Check for duplicates in 'cust':
    
cust_dups = cust[cust.duplicated()]
cust_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, Gender, STATE, Age, no_of_dependants, fam_status, income]
Index: []

##### - No duplicates founds in 'cust'.

In [15]:
# Check for mixed types in'cust':
    
for col in cust.columns.tolist():
  weird = (cust[[col]].applymap(type) != cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (cust[weird]) > 0:
        print (col)

first_name

In [16]:
type('first_name')

str

In [17]:
    # Replace mixed type in 'first_name' column in 'cust' df with string type:
    
cust['first_name'] = cust['first_name'].astype('str')

# 5. Combining 'customer' df with 'orders_products_merged_new_columns_and_flags.pkl' on 'user_id'

In [19]:
# Convert 'user_id' data type in 'cust' to string:
    
cust['user_id'] = cust['user_id'].astype('str')

In [20]:
cust['user_id'].dtype

dtype('O')

In [6]:
cust.shape

(206209, 10)

In [21]:
# Import 'orders_products_merged_new_columns_and_flags':
    
orders_products_merged = pd.read_pickle(os.path.join(path, '02 Data','Prepared Data','orders_products_merged_new_columns_and_flags.pkl'))

In [22]:
# Check the shape of 'orders_products_merged':
    
orders_products_merged.shape

(32404859, 27)

In [23]:
# Check the data type of 'user_id' in 'orders_products_merged':
    
orders_products_merged['user_id'].dtype

dtype('int64')

In [24]:
# Convert 'user_id' data type in 'orders_products_merged' to string:
    
orders_products_merged['user_id'] = orders_products_merged['user_id'].astype('str')

In [25]:
# Drop '_merge' in 'orders_products_merged':
    
orders_products_merged = orders_products_merged.drop(columns = ['_merge'])

In [26]:
# Merge 'cust' with 'orders_products_merged_new_columns_and_flags':

orders_products_cust_merged = cust.merge(orders_products_merged, on = 'user_id', indicator = True)

In [27]:
orders_products_cust_merged.head()

,user_id,first_name,last_name,Gender,STATE,Age,no_of_dependants,fam_status,income,Unnamed: 0.1,...,busiest_day,busy_slow_days,busiest_period_of_day,max_order,loyalty_flag,mean_price,spending_flag,median_days_since,frequency_flag,_merge
0,26711,Deborah,Esquivel,Female,Missouri,48,3,married,165665,443895,...,Regularly busy,Busiest days,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
1,26711,Deborah,Esquivel,Female,Missouri,48,3,married,165665,443897,...,Regularly busy,Regularly busy,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
2,26711,Deborah,Esquivel,Female,Missouri,48,3,married,165665,443898,...,Regularly busy,Busiest days,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
3,26711,Deborah,Esquivel,Female,Missouri,48,3,married,165665,443892,...,Regularly busy,Regularly busy,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
4,26711,Deborah,Esquivel,Female,Missouri,48,3,married,165665,443893,...,Regularly busy,Slowest days,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both

In [28]:
# Check the shape of the new 'orders_products_cust_merged':

orders_products_cust_merged.shape

(32404859, 35)

In [29]:
orders_products_cust_merged.columns

Index(['user_id', 'first_name', 'last_name', 'Gender', 'STATE', 'Age',
       'no_of_dependants', 'fam_status', 'income', 'Unnamed: 0.1',
       'Unnamed: 0_x', 'order_id', 'order_number', 'orders_day_of_week',
       'time_of_order, hour', 'days_since_prior_order', 'product_id',
       'add_to_cart_order', 'reordered', 'Unnamed: 0_y', 'product_name',
       'aisle_id', 'department_id', 'prices', 'price_range_loc', 'busiest_day',
       'busy_slow_days', 'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'mean_price', 'spending_flag', 'median_days_since', 'frequency_flag',
       '_merge'],
      dtype='object')

In [30]:
# Confirm the results of the merge using merge flag:
    
orders_products_cust_merged['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

# 6. Exporting 'orders_products_cust_merged' as 'orders_products_customers_merged.pkl'

In [31]:
# Item 8. Export 'orders_products_cust_merged':

orders_products_cust_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data','orders_products_customers_merged.pkl'))